src/cf/Documents/ОплатаЧерезКассу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОплатаЧерезКассу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СебестоимостьПродукции</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиТорговыхТочек</xr:Item>
				<xr:Item>AccumulationRegister.СкидкиНаПродукцию</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиПродукции</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Comment>Место производства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Покупка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ОплатаЧерезКассу/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПокупкаКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Покупка.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ПокупкаЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Покупка.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры   

&НаКлиенте
Процедура ПокупкаСкидкаПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Покупка.ТекущиеДанные;
	РаботаСДокументамиКлиент.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры


&НаКлиенте
Процедура ПокупкаНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти=Элементы.Покупка.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена=РаботаСоСправочникамиСервер.РозничнаяЦена(Объект.Дата,СтрокаТабличнойЧасти.Номенклатура);

	РаботаСДокументамиКлиент.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры
